// var typeData = ["115KV", "33KV", "22KV"];

// var type115_equipment = [
//     "เสา",
//     "ระบบต่อลงดินOHGW/OPGW",
//     "ลูกถ้วยระบบสายส่ง",
//     "สายไฟระบบสายส่ง และอุปกรณ์จับสาย",
//     "จุดต่อในระบบสายส่ง",
//     "อุปกรณ์ป้องกันและตัดตอน",

// ]

// var type115_topic = new Map([

//     ["เสา", new Map([
//         ["เสาคอนกรีต", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "อื่่นๆ"]],
//         ["เสาโครงเหล็ก", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "อื่่นๆ"]],
//         ["คอนคอนกรีต", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "bolt/nut หลวม,หลุด", "bolt/nut เปลี่ยนสี,เป็นสนิม", "อื่่นๆ"]],
//         ["คอนเหล็ก", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "bolt/nut หลวม,หลุด", "bolt/nut เปลี่ยนสี,เป็นสนิม", "อื่่นๆ"]]
//     ])],

//     ["ระบบต่อลงดินOHGW/OPGW", new Map([
//         ["สาย OHGW/OPGW", ["สภาพปกติ", "สายขาด", "เป็นสนิม", "อื่่นๆ"]],
//         ["สาย GROUND", ["สภาพปกติ", "สายขาด", "เป็นสนิม", "อื่่นๆ"]],
//         ["เหล็กรองรับสาย OHGW/OPGW", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "อื่่นๆ"]],
//         ["จุดต่อระบบต่อลงดิน", ["สภาพปกติ", "จุดต่อOHGW/OPGW : หลวม,หลุด", "จุดต่อOHGW/OPGW : เปลี่ยนสี", "จุดต่อOHGW/OPGW : รอยอาร์ค", "จุดต่อOHGW/OPGW : รอยอาร์ค", "จุดต่อOHGW/OPGW : เป็นสนิม", "จุดต่อที่หัวเสา : หลวม,หลุด", "จุดต่อที่หัวเสา : เปลี่ยนสี", "จุดต่อที่หัวเสา : รอยอาร์ค", "จุดต่อที่หัวเสา : เป็นสนิม", "จุดต่อที่ GROUND PLATE : หลวม,หลุด", "อื่่นๆ"]],
//     ])],

//     ["ลูกถ้วยระบบสายส่ง", new Map([
//         ["ลูกถ้วยกระเบื้อง", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยคอมโพสิท", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยแก้วเหนียว", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//     ])],

//     ["สายไฟระบบสายส่ง และอุปกรณ์จับสาย", new Map([
//         ["สายเปลือย", ["สภาพปกติ", "รอยแตก,ขาด", "หลุดจากลูกถ้วย", "อื่่นๆ"]],
//         ["preform armorod", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//         ["preform armogrip", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["preform แยกสาย", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["strain clamp", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["suspension clamp", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//     ])],

//     ["จุดต่อในระบบสายส่ง", new Map([
//         ["t-slip", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["t-clamp (แคล้มป์มือเสือ)", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["หางปลา", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["หลอดต่อสาย", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//     ])],

//     ["อุปกรณ์ป้องกันและตัดตอน", new Map([
//         ["air break switch", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "ลูกถ้วยซับพอร์ต : เป็นสนิม", "ลูกถ้วยซับพอร์ต : หลวม,หลุด", "จุดต่อ terminal clamp/pad : รอยอาร์ค", "ชุดตัดอาร์ค หนวดกุ้ง : ชำรุด", "อื่่นๆ"]],
//         ["load break switch", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "ลูกถ้วยซับพอร์ต : เป็นสนิม", "ลูกถ้วยซับพอร์ต : หลวม,หลุด", "จุดต่อ terminal clamp/pad : รอยอาร์ค", "ชุดดับอาร์ค : ชำรุด", "อื่่นๆ"]],
//         ["circuit switcher", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "ลูกถ้วยซับพอร์ต : เป็นสนิม", "ลูกถ้วยซับพอร์ต : หลวม,หลุด", "จุดต่อ terminal clamp/pad : รอยอาร์ค", "อื่่นๆ"]],

//     ])],



// ]);

// // --------------------------33
// var type33_equipment = [
//     "เสา",
//     "ระบบต่อลงดิน OHGW",
//     "ลูกถ้วยระบบจำหน่าย",
//     "สายไฟระบบจำหน่าย และอุปกรณ์จับสาย",
//     "จุดต่อในระบบจำหน่าย",
//     "อุปกรณ์ป้องกันและตัดตอน",
//     "กับดักเสิร์จ",
//     "คาปาซิเตอร์",
//     "CT/VT"
// ]

// var type33_topic = new Map([

//     ["เสา", new Map([
//         ["เสาคอนกรีต", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "อื่่นๆ"]],
//         ["เสาโครงเหล็ก", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "อื่่นๆ"]],
//         ["คอนคอนกรีต", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "bolt/nut หลวม,หลุด", "bolt/nut เปลี่ยนสี,เป็นสนิม", "bond wire หลุด,ขาด", "อื่่นๆ"]],
//         ["คอนเหล็ก", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "bolt/nut หลวม,หลุด", "bolt/nut เปลี่ยนสี,เป็นสนิม", "bond wire หลุด,ขาด", "อื่่นๆ"]],
//     ])],

//     ["ระบบต่อลงดิน OHGW", new Map([
//         ["สาย OHGW", ["สภาพปกติ", "สายขาด", "เป็นสนิม", "อื่่นๆ"]],
//         ["สาย GROUND", ["สภาพปกติ", "สายขาด", "เป็นสนิม", "อื่่นๆ"]],
//         ["เหล็กรองรับสาย OHGW", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "อื่่นๆ"]],
//         ["จุดต่อระบบต่อลงดิน", ["สภาพปกติ", "จุดต่อที่OHGW : หลวม,หลุด", "จุดต่อที่OHGW : เปลี่ยนสี", "จุดต่อที่OHGW : รอยอาร์ค", "จุดต่อที่OHGW : เป็นสนิม", "จุดต่อที่หัวเสา : หลวม,หลุด", "จุดต่อที่หัวเสา : เปลี่ยนสี", "จุดต่อที่หัวเสา : รอยอาร์ค", "จุดต่อที่หัวเสา : เป็นสนิม", "อื่่นๆ"]],
//     ])],

//     ["ลูกถ้วยระบบจำหน่าย", new Map([
//         ["ลูกถ้วยกระเบื้อง : ชนิด Pin Type", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง : ชนิด Line Post", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง : ชนิด Pin Post", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง : ชนิด ลูกถ้วยแขวน", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยคอมโพสิท", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยแก้วเหนียว", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//     ])],


//     ["สายไฟระบบจำหน่าย และอุปกรณ์จับสาย", new Map([
//         ["สายเปลือย", ["สภาพปกติ", "รอยแตก,ขาด", "หลุดจากลูกถ้วย", "อื่่นๆ"]],
//         ["สายหุ้มฉนวน", ["สภาพปกติ", "รอยแตก,ขาด", "หลุดจากลูกถ้วย/สเปเซอร์", "อื่่นๆ"]],
//         ["tie wire", ["สภาพปกติ", "หลวม,หลุด", "อื่่นๆ"]],
//         ["cover tie wire", ["สภาพปกติ", "หลวม,หลุด", "อื่่นๆ"]],
//         ["snap tie", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//         ["strain clamp", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//         ["preform", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//     ])],

//     ["จุดต่อในระบบจำหน่าย", new Map([
//         ["belt clamp,hotline clamp", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["t-clamp (แคล้มป์มือเสือ)", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["pg clamp", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["pin terminal", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["หางปลา", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["หลอดต่อสาย", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//     ])],

//     ["อุปกรณ์ป้องกันและตัดตอน", new Map([
//         ["air break switch", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "อื่่นๆ"]],
//         ["disconnecting switch", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "อื่่นๆ"]],
//         ["ดรอปเอ้า ฟิวส์ คัทเอ้าท์", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่่นๆ"]],
//         ["load break switch (SF6 )", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่่นๆ"]],
//         ["recloser", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "ตัวถัง : เป็นสนิม", "ตัวถัง : น้ำมันรั่ว", "อื่่นๆ"]],
//     ])],

//     ["กับดักเสิร์จ", new Map([
//         ["กับดักเสิร์จกระเบื้อง : สายลีดเข้าหัวกับดักเสิร์จ", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "สายต่อลงดิน : รอยอาร์ค", "สายต่อลงดิน : หลวม,หลุด", "ครีบ : บิ่น,แตก", "ครีบ : เปลี่ยนสี", "ครีบ : รอยอาร์ค", "ครีบ : ผิวสกปรก", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่นๆ"]],
//         ["กับดักเสิร์จคอมโพสิท", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "สายต่อลงดิน : รอยอาร์ค", "สายต่อลงดิน : หลวม,หลุด", "ครีบ : บิ่น,แตก", "ครีบ : เปลี่ยนสี", "ครีบ : รอยอาร์ค", "ครีบ : ผิวสกปรก", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่นๆ"]],
//     ])],

//     ["คาปาซิเตอร์", new Map([
//         ["fix capacitor", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp : หลวม,หลุด", "จุดต่อ terminal clamp : เป็นสนิม", "จุดต่อ terminal clamp : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ชุดแขวนคาปา (Hanger) ชำรุด", "อื่่นๆ"]],
//         ["switching capacitor", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp : หลวม,หลุด", "จุดต่อ terminal clamp : เป็นสนิม", "จุดต่อ terminal clamp : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ชุดแขวนคาปา (Hanger) ชำรุด", "ชุด interrupt : ชำรุด", "อื่่นๆ"]],
//     ])],

//     ["CT/VT", new Map([
//         ["CT", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "บุชชิ่ง :  หลวม,หลุด", "จุดต่อ terminal : เป็นสนิม", "จุดต่อ terminal : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ไม้แป้น : ชำรุด", "อื่่นๆ"]],
//         ["VT", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "บุชชิ่ง :  หลวม,หลุด", "จุดต่อ terminal : เป็นสนิม", "จุดต่อ terminal : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ไม้แป้น : ชำรุด", "อื่่นๆ"]],
//     ])],

// ]);

// //--------------------------22

// var type22_equipment = [
//     "เสา",
//     "ระบบต่อลงดิน OHGW",
//     "ลูกถ้วยระบบจำหน่าย",
//     "สายไฟระบบจำหน่าย และอุปกรณ์จับสาย",
//     "จุดต่อในระบบจำหน่าย",
//     "อุปกรณ์ป้องกันและตัดตอน",
//     "กับดักเสิร์จ",
//     "คาปาซิเตอร์",
//     "CT/VT"
// ]

// var type22_topic = new Map([


//     ["เสา", new Map([
//         ["เสาคอนกรีต", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "อื่่นๆ"]],
//         ["เสาโครงเหล็ก", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "อื่่นๆ"]],
//         ["คอนคอนกรีต", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "bolt/nut หลวม,หลุด", "bolt/nut เปลี่ยนสี,เป็นสนิม", "bond wire หลุด,ขาด", "อื่่นๆ"]],
//         ["คอนเหล็ก", ["สภาพปกติ", "บิ่น,แตก", "บิดงอ,เสียรูป", "bolt/nut หลวม,หลุด", "bolt/nut เปลี่ยนสี,เป็นสนิม", "bond wire หลุด,ขาด", "อื่่นๆ"]],
//     ])],

//     ["ระบบต่อลงดิน OHGW", new Map([
//         ["สาย OHGW", ["สภาพปกติ", "สายขาด", "เป็นสนิม", "อื่่นๆ"]],
//         ["สาย GROUND", ["สภาพปกติ", "สายขาด", "เป็นสนิม", "อื่่นๆ"]],
//         ["เหล็กรองรับสาย OHGW", ["สภาพปกติ", "บิดงอ,เสียรูป", "เป็นสนิม", "อื่่นๆ"]],
//         ["จุดต่อระบบต่อลงดิน", ["สภาพปกติ", "จุดต่อที่OHGW : หลวม,หลุด", "จุดต่อที่OHGW : เปลี่ยนสี", "จุดต่อที่OHGW : รอยอาร์ค", "จุดต่อที่OHGW : เป็นสนิม", "จุดต่อที่หัวเสา : หลวม,หลุด", "จุดต่อที่หัวเสา : เปลี่ยนสี", "จุดต่อที่หัวเสา : รอยอาร์ค", "จุดต่อที่หัวเสา : เป็นสนิม", "อื่่นๆ"]],
//     ])],

//     ["ลูกถ้วยระบบจำหน่าย", new Map([
//         ["ลูกถ้วยกระเบื้อง : ชนิด Pin Type", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง : ชนิด Line Post", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง : ชนิด Pin Post", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง : ชนิด ลูกถ้วยแขวน", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยกระเบื้อง", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยคอมโพสิท", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//         ["ลูกถ้วยแก้วเหนียว", ["สภาพปกติ", "บิ่น,แตก", "เปลี่ยนสี", "รอยอาร์ค", "ผิวสกปรก", "หลวม,หลุด", "ก้านเป็นสนิม", "อื่่นๆ"]],
//     ])],


//     ["สายไฟระบบจำหน่าย และอุปกรณ์จับสาย", new Map([
//         ["สายเปลือย", ["สภาพปกติ", "รอยแตก,ขาด", "หลุดจากลูกถ้วย", "อื่่นๆ"]],
//         ["สายหุ้มฉนวน", ["สภาพปกติ", "รอยแตก,ขาด", "หลุดจากลูกถ้วย/สเปเซอร์", "อื่่นๆ"]],
//         ["tie wire", ["สภาพปกติ", "หลวม,หลุด", "อื่่นๆ"]],
//         ["cover tie wire", ["สภาพปกติ", "หลวม,หลุด", "อื่่นๆ"]],
//         ["snap tie", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//         ["strain clamp", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//         ["preform", ["สภาพปกติ", "หลวม,หลุด", "รอยแตก,ขาด", "อื่่นๆ"]],
//     ])],

//     ["จุดต่อในระบบจำหน่าย", new Map([
//         ["belt clamp,hotline clamp", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["t-clamp (แคล้มป์มือเสือ)", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["pg clamp", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["pin terminal", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["หางปลา", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//         ["หลอดต่อสาย", ["สภาพปกติ", "บิดงอ,เสียรูป", "เปลี่ยนสี", "รอยอาร์ค", "เป็นสนิม", "หลวม,หลุด", "อื่่นๆ"]],
//     ])],

//     ["อุปกรณ์ป้องกันและตัดตอน", new Map([
//         ["air break switch", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "อื่่นๆ"]],
//         ["disconnecting switch", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "ลูกถ้วยซับพอร์ต : เปลี่ยนสี", "ลูกถ้วยซับพอร์ต : รอยอาร์ค", "ลูกถ้วยซับพอร์ต : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "อื่่นๆ"]],
//         ["ดรอปเอ้า ฟิวส์ คัทเอ้าท์", ["สภาพปกติ", "ลูกถ้วยซับพอร์ต : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่่นๆ"]],
//         ["load break switch (SF6 )", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่่นๆ"]],
//         ["recloser", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp/หางปลา : หลวม,หลุด", "จุดต่อ terminal clamp/หางปลา : เป็นสนิม", "จุดต่อ terminal clamp/หางปลา : รอยอาร์ค", "ตัวถัง : เป็นสนิม", "ตัวถัง : น้ำมันรั่ว", "อื่่นๆ"]],
//     ])],

//     ["กับดักเสิร์จ", new Map([
//         ["กับดักเสิร์จกระเบื้อง : สายลีดเข้าหัวกับดักเสิร์จ", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "สายต่อลงดิน : รอยอาร์ค", "สายต่อลงดิน : หลวม,หลุด", "ครีบ : บิ่น,แตก", "ครีบ : เปลี่ยนสี", "ครีบ : รอยอาร์ค", "ครีบ : ผิวสกปรก", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่นๆ"]],
//         ["กับดักเสิร์จคอมโพสิท", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "สายต่อลงดิน : รอยอาร์ค", "สายต่อลงดิน : หลวม,หลุด", "ครีบ : บิ่น,แตก", "ครีบ : เปลี่ยนสี", "ครีบ : รอยอาร์ค", "ครีบ : ผิวสกปรก", "Bracket : เป็นสนิม", "Bracket : หลวม,หลุด", "อื่นๆ"]],
//     ])],

//     ["คาปาซิเตอร์", new Map([
//         ["fix capacitor", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp : หลวม,หลุด", "จุดต่อ terminal clamp : เป็นสนิม", "จุดต่อ terminal clamp : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ชุดแขวนคาปา (Hanger) ชำรุด", "อื่่นๆ"]],
//         ["switching capacitor", ["สภาพปกติ", "สายลีด : หลวม,หลุด", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "จุดต่อ terminal clamp : หลวม,หลุด", "จุดต่อ terminal clamp : เป็นสนิม", "จุดต่อ terminal clamp : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ชุดแขวนคาปา (Hanger) ชำรุด", "ชุด interrupt : ชำรุด", "อื่่นๆ"]],
//     ])],

//     ["CT/VT", new Map([
//         ["CT", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "บุชชิ่ง :  หลวม,หลุด", "จุดต่อ terminal : เป็นสนิม", "จุดต่อ terminal : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ไม้แป้น : ชำรุด", "อื่่นๆ"]],
//         ["VT", ["สภาพปกติ", "บุชชิ่ง : บิ่น,แตก", "บุชชิ่ง : เปลี่ยนสี", "บุชชิ่ง : รอยอาร์ค", "บุชชิ่ง : ผิวสกปรก", "บุชชิ่ง :  หลวม,หลุด", "จุดต่อ terminal : เป็นสนิม", "จุดต่อ terminal : รอยอาร์ค", "ตัวถัง : น้ำมันรั่ว", "ตัวถัง : เป็นสนิม", "ไม้แป้น : ชำรุด", "อื่่นๆ"]],
//     ])],


// ]);


// $('document').ready(function() {
//     setting();
//     $('#chapter').multipleSelect({
//         showClear: true
//     })
// });

// function setting() {
//     addData();

//     $("input[name='typeDataBox']").on("change", function() {
//         $("li").removeClass("selected");
//         $(".ms-choice span").text("");
//         $("#subject").html('');
//         $("#subject").html('<option value=" " selected="selected">ประเภทอุปกรณ์</option>');
//         $("#topic").html('');
//         $("#topic").html('<option value=" " selected="selected">ชนิดอุปกรณ์</option>');
//         console.log($("input[name='typeDataBox']:checked").val())
//         if ($("input[name='typeDataBox']:checked").val() == "22KV") {
//             for (var i = 0; i < type22_equipment.length; i++) {
//                 $("#subject").append(
//                     ` <option value="` + type22_equipment[i] + `">` + type22_equipment[i] + `</option>`
//                 );
//             }
//             onChangeType()
//         } else if ($("input[name='typeDataBox']:checked").val() == "33KV") {
//             for (var i = 0; i < type33_equipment.length; i++) {
//                 $("#subject").append(
//                     ` <option value="` + type33_equipment[i] + `">` + type33_equipment[i] + `</option>`
//                 );
//             }
//             onChangeType()
//         } else if ($("input[name='typeDataBox']:checked").val() == "115KV") {
//             for (var i = 0; i < type115_equipment.length; i++) {
//                 $("#subject").append(
//                     ` <option value="` + type115_equipment[i] + `">` + type115_equipment[i] + `</option>`
//                 );
//             }
//             onChangeType()
//         }
//     });

// }

// function addData() {
//     $("#subject").append(
//         ` <option value=" " selected="selected">ประเภทอุปกรณ์</option>`
//     );
//     $("#topic").append(
//         `<option value=" " selected="selected">ชนิดอุปกรณ์</option>`
//     );
//     $("#chapter").append('');
//     for (var i = 0; i < typeData.length; i++) {
//         $(".radio_box").append(
//             `<label> 
//                 <input type="radio" class="dataBox" name="typeDataBox" value="` + typeData[i] + `"></input>
//                 ` + typeData[i] + `
//             </label>`
//         )
//     }

// }

// function onChangeType() {

//     $("#subject").on("change", function() {
//         var subject = $("#subject").val();
//         $("li").removeClass("selected");
//         $(".ms-choice span").text("");
//         $("#topic").html('');
//         $("#topic").html('<option value=" " selected="selected">ชนิดอุปกรณ์</option>');
//         console.log($("#subject").val())
//         if ($("input[name='typeDataBox']:checked").val() == "22KV") {
//             var s1 = type22_topic.get(subject).entries();
//             while (1) {
//                 v = s1.next()
//                 if (v.done) break;

//                 $("#topic").append(
//                     ` <option value="` + v.value[0] + `">` + v.value[0] + `</option>`
//                 );
//             }
//             $("#topic").on("change", function() {
//                 var topic = $("#topic").val();
//                 console.log(topic)
//                 type22_topic.get(subject).get(topic);
//                 $("#chapter").html("");
//                 for (var k = 0; k < type22_topic.get(subject).get(topic).length; k++) {
//                     $("#chapter").append(
//                         ` <option value="` + type22_topic.get(subject).get(topic)[k] + `" >` + type22_topic.get(subject).get(topic)[k] + `</option>`
//                     ).multipleSelect('refresh');
//                 }
//             });
//         } else if ($("input[name='typeDataBox']:checked").val() == "33KV") {
//             var s1 = type33_topic.get(subject).entries();
//             while (1) {
//                 v = s1.next()
//                 if (v.done) break;

//                 $("#topic").append(
//                     ` <option value="` + v.value[0] + `">` + v.value[0] + `</option>`
//                 );
//             }
//             $("#topic").on("change", function() {
//                 var topic = $("#topic").val();
//                 console.log(topic)
//                 type33_topic.get(subject).get(topic);
//                 $("#chapter").html("");
//                 for (var k = 0; k < type33_topic.get(subject).get(topic).length; k++) {
//                     $("#chapter").append(
//                         ` <option value="` + type33_topic.get(subject).get(topic)[k] + `" >` + type33_topic.get(subject).get(topic)[k] + `</option>`
//                     ).multipleSelect('refresh');
//                 }
//             });
//         } else if ($("input[name='typeDataBox']:checked").val() == "115KV") {
//             var s1 = type115_topic.get(subject).entries();
//             while (1) {
//                 v = s1.next()
//                 if (v.done) break;

//                 $("#topic").append(
//                     ` <option value="` + v.value[0] + `">` + v.value[0] + `</option>`
//                 );
//             }
//             $("#topic").on("change", function() {
//                 var topic = $("#topic").val();
//                 console.log(topic)
//                 type115_topic.get(subject).get(topic);
//                 $("#chapter").html("");
//                 for (var k = 0; k < type115_topic.get(subject).get(topic).length; k++) {
//                     $("#chapter").append(
//                         ` <option value="` + type115_topic.get(subject).get(topic)[k] + `" >` + type115_topic.get(subject).get(topic)[k] + `</option>`
//                     ).multipleSelect('refresh');
//                 }
//             });
//         }

//     });

// }